# <font color=steelblue>**Introduction to Python**</font>

[Python](https://en.wikipedia.org/wiki/Python_(programming_language)#cite_note-AutoNT-7-26) is an intepreted, high-level, general-purpose programming language ("Python" n.d., para. 1). In this case, the aim of the notebook is to introduce the user to different basic functions of `Python`.

## <font color=darkgreen>I. Basic functions of python</font>

The operations of python are addition `+`, subtraction `-`, multiplication `*`, division `/`, integer division `//`, modulo `%` and exponentiation `**`

In [65]:
9+4,9-4,9*4,9/4,9//4,9%4,9**4

(13, 5, 36, 2.25, 2, 1, 6561)

However, if multiple outputs from multiple inputs are required, the `print` function would be useful.

In [66]:
print(7-3)
print(7+3)
print(7/3)

4
10
2.3333333333333335

## <font color=darkgreen>II. Variables and their types</font>

Variables are a way to store big or small data but for now, small examples will be shown today. To get the class of a variable created, use the function `type`.

In [67]:
a = 3/2
type(a)

float

In [68]:
b = 'string'
type(b)

str

In [69]:
c = ['1',1, 2,3]
type(c)

list

Note that the `list` is one of the most powerful types in Python since it can store different types of variables. Also, it is allowed to add two different list even with different length and different type of variables. In this case, doing functions with `list` constitutes an efficient way.

In [70]:
c = c + ['3']
c

['1', 1, 2, 3, '3']

In [71]:
d =(2,2)
type(d)
d = d+(3,3)
print(d)
type(d)

(2, 2, 3, 3)

tuple

Unlike `list`, `tuple` is immutable, meaning it cannot be modified or manipulated. However, it is useful in storing final values. Lists are enclosed in `[]` while tuples are enclosed in `()`. Lastly, a `dictionary` is created for storing and extracting values through `key-value` pairs. Unlike sequences which are indexed by numbers, the values from the `dictionary` can be extracted via a specific `key`. Also, a `dictionary` can bve created via series of tuples with `dict` function.

There are two ways to create a dictionary. One is by using `:` and another is by using `2-tuples`.

In [72]:
ContinentDict  = {'China':'Asia', 
                  'United States':'North America', 
                  'Japan':'Asia', 
                  'United Kingdom':'Europe'}
ContinentDict['China']

'Asia'

| Stretch/Untouched | ProbDistribution | Accuracy |
| --- | --- | --- |
| Stretched | Gaussian | .843 |
| Stretched | Gaussian | .843 |

In [73]:
list_cont = [('China', 'Asia'), ('United States', 'North America'), ('Japan', 'Asia'),('United Kingdom','Europe')]
ContinentDict2 = dict(list_cont)
ContinentDict2['China']

'Asia'

## <font color=darkgreen>III. Creating functions</font>

Functions are one of the most important things in using Python. Functions do operate on the usual `input-output` basis. You can create a funciton by using the `def` function. However, if creating a function is necessary but could want to shorten the code, the `lambda` function helpful. Lastly, if there are pre-packaged function but it would be used across rows or columns,, `apply` and `map` would be helpful. The speed of these functions depends on the complexity and the types of variables involved.

In [85]:
import pandas as pd
import regex as re
import numpy as np

In [75]:
example = pd.read_excel('Example_Data_2.xlsx')
example

                          Name        Value
0  10-K_Y2018Q2_0000095521.txt  552658.5559
1  10-K_Y2018Q2_0000098752.txt  869677.6460
2  10-K_Y2018Q2_0000099302.txt  245586.6841
3  10-K_Y2018Q2_0000949721.txt  459161.8361
4  10-K_Y2018Q2_0000949961.txt  912632.4169
5  10-K_Y2018Q3_0000092679.txt  977833.1240
6  10-K_Y2018Q3_0000093676.txt  623919.3635
7  10-K_Y2018Q3_0000096021.txt  635373.8904
8  10-K_Y2018Q3_0000096536.txt  237143.9653
9  10-K_Y2018Q3_0000096793.txt  389276.6513

In [76]:
def get_filing_type(text):
    sec_type = re.search('^[^_]+(?=_)', text)
    sec_name = sec_type.group(0)
    return sec_name

In [77]:
example['Type'] = example['Name'].apply(get_filing_type)

In [78]:
example['ThousandAsString'] = example.apply(lambda row: '$' + str(round(row['Value'] / 1000,2)) + 'TH', axis=1)

In [79]:
type(example['Value'][0])

numpy.float64

In [80]:
example

                          Name        Value  Type ThousandAsString
0  10-K_Y2018Q2_0000095521.txt  552658.5559  10-K        $552.66TH
1  10-K_Y2018Q2_0000098752.txt  869677.6460  10-K        $869.68TH
2  10-K_Y2018Q2_0000099302.txt  245586.6841  10-K        $245.59TH
3  10-K_Y2018Q2_0000949721.txt  459161.8361  10-K        $459.16TH
4  10-K_Y2018Q2_0000949961.txt  912632.4169  10-K        $912.63TH
5  10-K_Y2018Q3_0000092679.txt  977833.1240  10-K        $977.83TH
6  10-K_Y2018Q3_0000093676.txt  623919.3635  10-K        $623.92TH
7  10-K_Y2018Q3_0000096021.txt  635373.8904  10-K        $635.37TH
8  10-K_Y2018Q3_0000096536.txt  237143.9653  10-K        $237.14TH
9  10-K_Y2018Q3_0000096793.txt  389276.6513  10-K        $389.28TH

In [81]:
example['Value'] = example['Value'].map(lambda x: '%.2f' % x)

In [82]:
example

                          Name      Value  Type ThousandAsString
0  10-K_Y2018Q2_0000095521.txt  552658.56  10-K        $552.66TH
1  10-K_Y2018Q2_0000098752.txt  869677.65  10-K        $869.68TH
2  10-K_Y2018Q2_0000099302.txt  245586.68  10-K        $245.59TH
3  10-K_Y2018Q2_0000949721.txt  459161.84  10-K        $459.16TH
4  10-K_Y2018Q2_0000949961.txt  912632.42  10-K        $912.63TH
5  10-K_Y2018Q3_0000092679.txt  977833.12  10-K        $977.83TH
6  10-K_Y2018Q3_0000093676.txt  623919.36  10-K        $623.92TH
7  10-K_Y2018Q3_0000096021.txt  635373.89  10-K        $635.37TH
8  10-K_Y2018Q3_0000096536.txt  237143.97  10-K        $237.14TH
9  10-K_Y2018Q3_0000096793.txt  389276.65  10-K        $389.28TH

In [83]:
type(example['Value'][0])

str

Summing up, `apply` works on a row / column basis of a DataFrame, `applymap` works element-wise on a DataFrame, and `map` works element-wise on a Series

Suppose we have a given data frame and we want to get the sum across the rows and columns. The `apply` function can be used. In this case, `apply` can be applied to either rows `[0]` or columns `[1]` .

In [86]:
rates = pd.DataFrame({'a':[1,2,4,6,8,4,3,2,7,4,4,9,7,3,1],'b':[2,5,4,1,3,6,5,2,5,1,8,7,9,4,4]})

In [87]:
rates

    a  b
0   1  2
1   2  5
2   4  4
3   6  1
4   8  3
5   4  6
6   3  5
7   2  2
8   7  5
9   4  1
10  4  8
11  9  7
12  7  9
13  3  4
14  1  4

In [88]:
rates.apply(np.sum, axis=0)

a    65
b    66
dtype: int64

In [89]:
rates.apply(np.sum, axis=1)

0      3
1      7
2      8
3      7
4     11
5     10
6      8
7      4
8     12
9      5
10    12
11    16
12    16
13     7
14     5
dtype: int64

In [91]:
rates['a_2'] = rates['a'].map(lambda x: x ** 2)

In [92]:
rates

    a  b  a_2
0   1  2    1
1   2  5    4
2   4  4   16
3   6  1   36
4   8  3   64
5   4  6   16
6   3  5    9
7   2  2    4
8   7  5   49
9   4  1   16
10  4  8   16
11  9  7   81
12  7  9   49
13  3  4    9
14  1  4    1

## <font color=darkgreen>IV. Reading and manipulating different files</font>

For one, `xml` files are relatively easy to read since there is a structure. However, there are infinite ways on presenting database on this form. Nevertheless, there are three main parts of an `xml` file. Unlike `html` files, `xml` files focused on wrapping information as it is rather than displaying. 

1. The `tag` is enclosed with `<>` indicating that a value surrounded by a pair of these characters is an element.
2. The `attribute` is enclosed with a `tag`. It gives a description of what the tag is all about.
3. The `text` is the one that is enclosed within a pair of tag. It is the nested information that we wanted to extract.

For example, in the file below, `catalog` is a tag, `id=bk101` is an attribute, and `Gambardella,Matthew` is a text

### <font color=darkred>1. XML</font>

In [93]:
xml = """<?xml version="1.0"?>
  <catalog>
     <shop number="1">
        <book id="bk101">
           <author>Gambardella, Matthew</author>
           <title>XML Developer's Guide</title>
           <genre>Computer</genre>
           <price>44.95</price>
           <publish_date>2000-10-01</publish_date>
           <description>An in-depth look at creating applications
           with XML.</description>
        </book>
        <book id="bk102">
           <author>Ralls, Kim</author>
           <title>Midnight Rain</title>
           <genre>Fantasy</genre>
           <price>5.95</price>
           <publish_date>2000-12-16</publish_date>
           <description>A former architect battles corporate zombies,
           an evil sorceress, and her own childhood to become queen
           of the world.</description>
        </book>
     </shop>
     <shop number="2">
        <book id="bk103">
           <author>Corets, Eva</author>
           <title>Maeve Ascendant</title>
           <genre>Fantasy</genre>
           <price>5.95</price>
           <publish_date>2000-11-17</publish_date>
           <description>After the collapse of a nanotechnology
           society in England, the young survivors lay the
           foundation for a new society.</description>
        </book>
        <book id="bk104">
           <author>Corets, Eva</author>
           <title>Oberon's Legacy</title>
           <genre>Fantasy</genre>
           <price>5.95</price>
           <publish_date>2001-03-10</publish_date>
           <description>In post-apocalypse England, the mysterious
           agent known only as Oberon helps to create a new life
           for the inhabitants of London. Sequel to Maeve
           Ascendant.</description>
        </book>
     </shop>
  </catalog>"""

The following modules are needed for extracting and manipulating these type of files. `Regex` or `Regular Expressions` are sequences of characters that could define a particular pattern while `xml.etree.ElementTree` treats every xml as a tree with roots and nodes.

`Problem 1:` The file `new 1` contains information about different countries with their corresponding continent, rank, and null . The aim is to get these countries with their corresponding stats and other features. Lastly: We want a dataframe consisting of countries with `rank` greater than `2` and `null` greater than `2`.

Initially, we parsed the file that is similar with this.

In [94]:
sample_xml = """<?xml version="1.0"?>
  <data>
     <continent name = 'Asia'>
        <country name = 'Philippines'>
           <rank>4</rank>
           <null>7</null>
        </country>
     </continent>
  </data>"""

In [95]:
import regex as re
import pandas as pd
import xml.etree.ElementTree as ET
root = ET.parse('new 1.xml').getroot()

We first get the distinct tags of the file first and then we use them to determine the right tags for extraction.

In [96]:
xmlTree = ET.parse('new 1.xml')
elemList = []
for elem in xmlTree.iter():
    elemList.append(elem.tag)
elemList = list(set(elemList))
print(elemList)

['rank', 'continent', 'null', 'data', 'country']

On the other hand, the `tag` and `attrib` depended on the tree or subtree we are looking for. In this case, we get the immediate `children nodes` of the file itself.

In [97]:
for child in root:
    print(child.tag,child.attrib)

continent {'name': 'Asia'}
continent {'name': 'Africa'}
continent {'name': 'Europe'}
continent {'name': 'North America'}
continent {'name': 'South America'}

Our initial solution is to use the `country` tag to find all countries and the corresponding children nodes. However, by doing this method, we cannot convert it into a dataframe in which we are aiming for. What the series of code does is by looking at all children nodes of the `continent` tag and getting the attributes aka the names of the countries.

In [98]:
for y in root.findall("./continent/country"):
    name = y.attrib
    country = name['name']
    rank = y[0].text
    null = y[1].text
    identity = '{0}-{1}-{2}'.format(country, rank, null)
    print(identity)

Philippines-4-7
China-2-3
Malaysia-4-4
India-3-2
Pakistan-3-5
Rwanda-2-4
South Sudan-4-6
Central African Republic-8-14
Chad-1-3
Finland-2-5
Switzerland-3-8
Greece-3-3
Cuba-2-2
Dominican Republic-7-10
El Salvador-4-5
Nicaragua-5-4
Jamaica-4-3
Guatemala-5-9
Haiti-3-2
Barbados-3-5
Canada-3-3
Brazil-2-4
Bolivia-4-3
Chile-2-3
Guyana-3-3
Argentina-4-5
Peru-2-2
Uruguay-4-3

Instead of the previous method, we implement this lines of code where we use `findall`, a function to find all instances of `country` children under `continent` parent. Then, we created a subtree and we extracted the text under the tags `rank` and `null`. Lastly, we created a dataframe.

In [99]:
df_cols = ["name", "rank", "null"]
out_df = pd.DataFrame(columns = df_cols)

for node in root.findall("./continent/country"): 
    c_name = node.attrib.get("name")
    c_rank = node.find("rank").text if node is not None else None
    c_null = node.find("null").text if node is not None else None
    
    out_df = out_df.append(pd.Series([c_name, c_rank, c_null], index = df_cols), ignore_index = True)

In [100]:
out_df

                        name rank null
0                Philippines    4    7
1                      China    2    3
2                   Malaysia    4    4
3                      India    3    2
4                   Pakistan    3    5
5                     Rwanda    2    4
6                South Sudan    4    6
7   Central African Republic    8   14
8                       Chad    1    3
9                    Finland    2    5
10               Switzerland    3    8
11                    Greece    3    3
12                      Cuba    2    2
13        Dominican Republic    7   10
14               El Salvador    4    5
15                 Nicaragua    5    4
16                   Jamaica    4    3
17                 Guatemala    5    9
18                     Haiti    3    2
19                  Barbados    3    5
20                    Canada    3    3
21                    Brazil    2    4
22                   Bolivia    4    3
23                     Chile    2    3
24                    Guyana    3    3
25                 Argentina    4    5
26                      Peru    2    2
27                   Uruguay    4    3

Since it is an `xml` file, everything would be strings hence, we considered using `to_numeric` to convert every numeric string to numeric.

In [101]:
type(out_df['rank'][2])

str

In [102]:
out_df['rank'] = pd.to_numeric(out_df['rank'])
out_df['null'] = pd.to_numeric(out_df['null'])

In [103]:
type(out_df['rank'][2])

numpy.int64

Then, we use multiple filters and since dataframe can be subseted based on boolean algebras, `&` is used for subsetting.

In [104]:
out_df = out_df[(out_df['rank'] > 2) & (out_df['null'] > 2 )]

In [105]:
out_df

                        name  rank  null
0                Philippines     4     7
2                   Malaysia     4     4
4                   Pakistan     3     5
6                South Sudan     4     6
7   Central African Republic     8    14
10               Switzerland     3     8
11                    Greece     3     3
13        Dominican Republic     7    10
14               El Salvador     4     5
15                 Nicaragua     5     4
16                   Jamaica     4     3
17                 Guatemala     5     9
19                  Barbados     3     5
20                    Canada     3     3
22                   Bolivia     4     3
24                    Guyana     3     3
25                 Argentina     4     5
27                   Uruguay     4     3

Suppose we want to get the `countries` and the `rank` given that their `null` is 5, we will use `loc`. The `loc` function is used for getting other columns based on the condtions of either of the columns involved or other columns. On the other hand, `iloc` can be used if we know the given row number and column number that we are looking for.

In [106]:
out_even_df = out_df.iloc[1::2,:]
out_even_df

                  name  rank  null
2             Malaysia     4     4
6          South Sudan     4     6
10         Switzerland     3     8
13  Dominican Republic     7    10
15           Nicaragua     5     4
17           Guatemala     5     9
20              Canada     3     3
24              Guyana     3     3
27             Uruguay     4     3

In [107]:
out_name_df = out_df.set_index("name")
out_name_df

                          rank  null
name
Philippines                  4     7
Malaysia                     4     4
Pakistan                     3     5
South Sudan                  4     6
Central African Republic     8    14
Switzerland                  3     8
Greece                       3     3
Dominican Republic           7    10
El Salvador                  4     5
Nicaragua                    5     4
Jamaica                      4     3
Guatemala                    5     9
Barbados                     3     5
Canada                       3     3
Bolivia                      4     3
Guyana                       3     3
Argentina                    4     5
Uruguay                      4     3

In [108]:
out_name_df.loc['Guatemala']

rank    5
null    9
Name: Guatemala, dtype: int64

In [109]:
out_name_df.loc[['Guatemala','Greece'],['rank']]

           rank
name
Guatemala     5
Greece        3

In [110]:
out_name_df.loc[out_name_df['null']==5,['rank']]

             rank
name
Pakistan        3
El Salvador     4
Barbados        3
Argentina       4

In [111]:
out_name_df.loc[out_name_df['null']==5,'rank']

name
Pakistan       3
El Salvador    4
Barbados       3
Argentina      4
Name: rank, dtype: int64

The difference between the two functions is that the former returns a DataFrame while the latter returns a Series. This is why we have to be cautious of using `loc` to subset a dataframe.

Lastly, we created a 2-dimension array containing the count of each unique pair. The `groupby` function can be used to extract multiple columns.

In [112]:
out_df.groupby(['rank', 'null']).count().unstack('null')

     name
null   3    4    5    6    7    8    9    10   14
rank
3     3.0  NaN  2.0  NaN  NaN  1.0  NaN  NaN  NaN
4     3.0  1.0  2.0  1.0  1.0  NaN  NaN  NaN  NaN
5     NaN  1.0  NaN  NaN  NaN  NaN  1.0  NaN  NaN
7     NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN
8     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0

Also, we can use indexing on the parsed `xml` file. The line indictated that we get the `0th` continent, `0th` country, `1st` description which is `Philippines` "null".

In [113]:
root[0][0][1].text

'7'

Lastly, we can get a parent node and a particular child node by indexing. In this example, we get the attributes of the continents with the attributes of the last country for each continent.

In [114]:
for continent in root.iter('continent'):
    print (continent.attrib,continent[-1].attrib)

{'name': 'Asia'} {'name': 'Pakistan'}
{'name': 'Africa'} {'name': 'Chad'}
{'name': 'Europe'} {'name': 'Greece'}
{'name': 'North America'} {'name': 'Canada'}
{'name': 'South America'} {'name': 'Uruguay'}

`Problem 2:` Given an `xml` file containing first level data, we want to extract all information to a dataframe. However, the `String` tag contains words enclosed in `<>` and therefore they must be removed.

In [115]:
def parse_XML(xml_file, df_cols): 
    """Parse the input XML file and store the result in a pandas DataFrame 
    with the given columns. The first element of df_cols is supposed to be 
    the identifier variable, which is an attribute of each node element in 
    the XML data; other features will be parsed from the text content of 
    each sub-element. """
    
    xtree = ET.parse(xml_file)
    xroot = xtree.getroot()
    out_df = pd.DataFrame(columns = df_cols)
    
    for node in xroot: 
        res = []
        for el in df_cols[0:]: 
            if node is not None:
                res.append(node.find(el).text)
            else: 
                res.append(None)
        out_df = out_df.append(pd.Series(res, index = df_cols), ignore_index = True)
        
    return out_df

In [116]:
data_df = parse_XML("allagents.xml", ["ID","String","Description","Type","Comment","Link1","Link2"])
for i in range(len(data_df)):
    data_df['String'][i] = re.sub('<[^>]+>', '', data_df['String'][i])
data_filter = data_df[data_df['Type']=='R']
data_filter.head()

,ID,String,Description,Type,Comment,Link1,Link2
1,id_a_f_6,UnChaos From Chaos To Order Hybrid Web Searc...,UnCHAOS search robot,R,Site is dead,http://www.unchaos.com/,None
2,id_a_f_7,UnChaos Bot Hybrid Web Search Engine. (vadim...,UnCHAOS search robot,R,Site is dead,http://www.unchaos.com/,None
3,id_a_f_8,UnChaosBot From Chaos To Order UnChaos Hybrid...,UnCHAOS search robot,R,Site is dead,http://www.unchaos.com/,None
4,id_a_f_9,http://www.sygol.com,Sygol Search (Italy) robot,R,s.also SygolBot,http://www.sygol.com/,None
8,id_a_f_230507_1,*/Nutch-0.9-dev,Unknown Yahoo robot,R,123.113.184.2xx,http://www.yahoo.com,None

In [118]:
data_filter.shape

(1361, 7)

Conclusion: Although `xml` files are organized, it is better to know the main structures before diving into extraction of the texts.

References:
`(1)`[The ElementTree XML API](https://docs.python.org/2/library/xml.etree.elementtree.html#module-xml.etree.ElementTree) `(2)` [PARSE AN XML FILE INTO A PANDAS DATAFRAME](https://robertopreste.com/blog/parse-xml-into-dataframe) `(3)`[Python XML with ElementTree: Beginner's Guide](https://www.datacamp.com/community/tutorials/python-xml-elementtree) `(4)` [iloc and loc](https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/)

### <font color=darkred>2. Text file</font>

`Problem 3:` Given a text file `consti` containing labels and the text in alternating order, clean the text, removing all non-alphabetic characters and those who are enclosed in `<>`,`[]`, and `()`.

In [119]:
text = open('consti.txt', 'r').read()
text = re.sub("[\(\[].*?[\)\]]", "", text)
text = re.sub('<[^>]+>', '', text)
text = re.sub('[!@#$%^&*_1234567890]', '', text)
text = text.replace('\n','')
text

'We, the sovereign Filipino people,  imploring the aid of Almighty God, in order to build a just and humane society, and establish a Government that shall embody our ideals and aspirations, promote the common good, conserve and develop our patrimony, and secure to ourselves and our posterity, the blessings of independence and democracy under the rule of law and a regime  of truth, justice, freedom, love, equality, and peace, do ordain and promulgate this Constitution.The Constitution also contains several other provisions enumerating various state policies including, i.e., the affirmation of labor "as a primary social economic force"; the equal protection of "the life of the mother and the life of the unborn from conception"; the "Filipino family as the foundation of the nation" ; the recognition of Filipino as "the national language of the Philippines", and even a requirement that "all educational institutions shall undertake regular sports activities throughout the country in cooperation with athletic clubs and other sectors."Whether these provisions may, by themselves, be the source of enforceable rights without accompanying legislation has been the subject of considerable debate in the legal sphere and within the Supreme Court. The Court, for example, has ruled that a provision requiring that the State "guarantee equal  access to opportunities to public service" could not be enforced without accompanying legislation, and thus could not bar the disallowance of so-called "nuisance candidates" in presidential elections. But in another case, the Court held that a provision requiring that the State "protect and advance the right of the people to a balanced and healthful ecology" did not require implementing legislation to become the source of operative rights.'

On the other hand, text files are more compatible in terms of storing large texts or a single column of text.

### <font color=darkred>3. JSON files</font>

A JSON file is a file that stores simple data structures and objects in JavaScript Object Notation (JSON) format, which is a standard data interchange format ([JSON](https://fileinfo.com/extension/json),n.d.). If the structure is only first level types, we could use the `read_json` from pandas. If not, we can only open and read the files by using `load` (for reading to a list) and `dumps` (for converting back to json).

In [120]:
import json

In [121]:
with open('rooms.json', 'r') as f:
    distros_dict = json.load(f)

In [122]:
distros_dict

[{'Name': 'Debian',
  'Version': '9',
  'Install': 'apt',
  'Owner': 'SPI',
  'Kernel': '4.9'},
 {'Name': 'Ubuntu',
  'Version': '17.10',
  'Install': 'apt',
  'Owner': 'Canonical',
  'Kernel': '4.13'},
 {'Name': 'Fedora',
  'Version': '26',
  'Install': 'dnf',
  'Owner': 'Red Hat',
  'Kernel': '4.13'},
 {'Name': 'CentOS',
  'Version': '7',
  'Install': 'yum',
  'Owner': 'Red Hat',
  'Kernel': '3.10'},
 {'Name': 'OpenSUSE',
  'Version': '42.3',
  'Install': 'zypper',
  'Owner': 'Novell',
  'Kernel': '4.4'},
 {'Name': 'Arch Linux',
  'Version': 'Rolling Release',
  'Install': 'pacman',
  'Owner': 'SPI',
  'Kernel': '4.13'},
 {'Name': 'Gentoo',
  'Version': 'Rolling Release',
  'Install': 'emerge',
  'Owner': 'Gentoo Foundation',
  'Kernel': '4.12'}]

In [123]:
data_back = json.dumps(distros_dict)
data_back

'[{"Name": "Debian", "Version": "9", "Install": "apt", "Owner": "SPI", "Kernel": "4.9"}, {"Name": "Ubuntu", "Version": "17.10", "Install": "apt", "Owner": "Canonical", "Kernel": "4.13"}, {"Name": "Fedora", "Version": "26", "Install": "dnf", "Owner": "Red Hat", "Kernel": "4.13"}, {"Name": "CentOS", "Version": "7", "Install": "yum", "Owner": "Red Hat", "Kernel": "3.10"}, {"Name": "OpenSUSE", "Version": "42.3", "Install": "zypper", "Owner": "Novell", "Kernel": "4.4"}, {"Name": "Arch Linux", "Version": "Rolling Release", "Install": "pacman", "Owner": "SPI", "Kernel": "4.13"}, {"Name": "Gentoo", "Version": "Rolling Release", "Install": "emerge", "Owner": "Gentoo Foundation", "Kernel": "4.12"}]'

In [124]:
data = pd.read_json('rooms.json')

In [125]:
data

  Install  Kernel        Name              Owner          Version
0     apt    4.90      Debian                SPI                9
1     apt    4.13      Ubuntu          Canonical            17.10
2     dnf    4.13      Fedora            Red Hat               26
3     yum    3.10      CentOS            Red Hat                7
4  zypper    4.40    OpenSUSE             Novell             42.3
5  pacman    4.13  Arch Linux                SPI  Rolling Release
6  emerge    4.12      Gentoo  Gentoo Foundation  Rolling Release

## <font color=darkgreen>V. Data Manipulation</font>

### <font color=darkred>1. one-dimension</font>

For the following module, we will focus on manipulating lists and different functions will be used. First, the module `collections` is imported to count the frequency of each item.

`Problem`: You have three lists containing fruits. However, you forgot to remove `garlic` and add `lime` to the list. The aim is to get every second fruit in the combined basket and do a frequency table.

In [126]:
import collections
import pandas as pd

In [127]:
fruits = ['apple', 'banana','garlic','banana','apricot','orange','tangerine','banana','pineapple','kiwi','grapes','watermelon','peach','lemon']
fruits_2 = ['apple','banana','avocado','cranberry','guava','jackfruit','cantaloupe','melon']
fruits_3 = ['blueberry','strawberry','blueberry','raspberry','cranberry','acai berry','loganberry','huckleberry','raspberry','blueberry']

However, `garlic` is not a fruit so it must be removed from the list. By using `remove`, it does the trick.

In [128]:
fruits.remove('garlic')
fruits

['apple',
 'banana',
 'banana',
 'apricot',
 'orange',
 'tangerine',
 'banana',
 'pineapple',
 'kiwi',
 'grapes',
 'watermelon',
 'peach',
 'lemon']

If we add another element, we use the `append` function. It operates as putting the added elements to the previously last element of the list.

In [129]:
fruits.append('lime')
fruits

['apple',
 'banana',
 'banana',
 'apricot',
 'orange',
 'tangerine',
 'banana',
 'pineapple',
 'kiwi',
 'grapes',
 'watermelon',
 'peach',
 'lemon',
 'lime']

Suppose you want to include the berries but the `append` function is applicable to one element. Hence, `extend` must be used.

In [130]:
fruits.extend(('strawberry','blueberry','raspberry'))
fruits

['apple',
 'banana',
 'banana',
 'apricot',
 'orange',
 'tangerine',
 'banana',
 'pineapple',
 'kiwi',
 'grapes',
 'watermelon',
 'peach',
 'lemon',
 'lime',
 'strawberry',
 'blueberry',
 'raspberry']

By using the `+` operation, we can concatenate different lists.

In [131]:
fruits_basket = fruits + fruits_2 + fruits_3
fruits_basket

['apple',
 'banana',
 'banana',
 'apricot',
 'orange',
 'tangerine',
 'banana',
 'pineapple',
 'kiwi',
 'grapes',
 'watermelon',
 'peach',
 'lemon',
 'lime',
 'strawberry',
 'blueberry',
 'raspberry',
 'apple',
 'banana',
 'avocado',
 'cranberry',
 'guava',
 'jackfruit',
 'cantaloupe',
 'melon',
 'blueberry',
 'strawberry',
 'blueberry',
 'raspberry',
 'cranberry',
 'acai berry',
 'loganberry',
 'huckleberry',
 'raspberry',
 'blueberry']

To get every second element of a list `::` is used. In our function below and since the indexing in `Python` starts at `0`, the term `1::2` consists of the terms `1,3,5,7,...`

In [132]:
fruits_odd = fruits_basket[1::2]
fruits_odd

['banana',
 'apricot',
 'tangerine',
 'pineapple',
 'grapes',
 'peach',
 'lime',
 'blueberry',
 'apple',
 'avocado',
 'guava',
 'cantaloupe',
 'blueberry',
 'blueberry',
 'cranberry',
 'loganberry',
 'raspberry']

To create a frequency table for each fruit, we imported the module `pandas` for our data manipulation. We used the function `Counter` to count the respective occurrences of each term. After that, we converted the counter to data frame. Lastly, we sorted the dataframe according to the column name.

In [133]:
counter=collections.Counter(fruits_odd)
freq = counter.most_common()
df = pd.DataFrame(freq, columns=['fruit','number'])
df = df.sort_values('fruit')
df = df.reset_index()
df = df[['fruit','number']]
df

         fruit  number
0        apple       1
1      apricot       1
2      avocado       1
3       banana       1
4    blueberry       3
5   cantaloupe       1
6    cranberry       1
7       grapes       1
8        guava       1
9         lime       1
10  loganberry       1
11       peach       1
12   pineapple       1
13   raspberry       1
14   tangerine       1

References : `(1)` [Data Structures](https://docs.python.org/3/tutorial/datastructures.html)

### <font color=darkred>2. two-dimension</font>

Before we dwell into this problem, a `dataframe` is a 2-D framework. Unlike list and dictionaries, you can store multiple of them across columns and rows. Lastly, dataframes easier to manipulate than other data types.

In [134]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(5))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

`Problem:` Given two stores who produce rectangular boxes of different size and it is paid 1 USD per square meter of surface area and 0.50 USD per cubic meter of volume. Each box has a unique `id`, which constitute different material and if an `id` ends with a `7`, the dimensions are measured in decimeters. The records are created and tabulated on the day each box was created. The goal is to find out `(1)` how much did you make for each store each day and `(2)` what are the common products sold each date for both stores

`Pandas` are used for data manipulation on a dataframe. A dataframe usually consists of rows and columns, which the index always starts at `0`. On the other hand, `numpy` is used for numeric calculation across lists and dataframes. If one aims to get more on the scientific computing part, `scipy` is the more helpful one.

In [135]:
import pandas as pd
import numpy as np

First, we read the imported `csv` and `xlsx` files and we identify the columns of the said data.

In [136]:
store_a = pd.read_csv('Rectangular_Prism.csv')
store_b = pd.read_excel('Rectangular_Prism_size.xlsx')

The `columns` functions identify the column names of the dataframe while the `shape` function returns the dimensions of the data frame. Lastly, the `head` function returns the first five rows of the dataframe.

In [137]:
store_a.columns

Index(['ID', 'Date', 'Length', 'Width', 'Height'], dtype='object')

In [138]:
store_b.shape

(1000, 5)

In [139]:
store_b.head()

     ID       Date  Length  Width  Height
0  8002 2019-01-24      13     10       4
1  2019 2019-01-21      10      7       6
2  8014 2019-01-21       1     12       7
3  1012 2019-01-24       3      7       7
4  4004 2019-01-22       1     12       9

Then, we checked if the dates on the dataframe are datetimes so we could manipulate the columns from them.

In [140]:
type(store_b['Date'][1])

pandas._libs.tslibs.timestamps.Timestamp

One good thing about using dataframes is that you can use apply functions across the columns given that the length of the columns affected are equal.

In [141]:
store_a['Date'] = pd.to_datetime(store_a['Date'],infer_datetime_format=True)
store_b['Date'] = pd.to_datetime(store_b['Date'],infer_datetime_format=True)

To answer `(2)`, we will use the function `merge`, which merges two different dataframes based on a given condition on column or columns. Also, we can overwrite the variable and get the necessary columns that we want.

The `merge` function has four methods of joining the dataframes.

1. left: use only keys from left frame, similar to a SQL left outer join; preserve key order
2. right: use only keys from right frame, similar to a SQL right outer join; preserve key order
3. outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically
4. inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys

In [142]:
both_store = pd.merge(store_a, store_b, how='inner', left_on=['ID','Date'], right_on=['ID','Date'])
both_store = both_store[['ID','Date']]

Since we want to know the number of products sold for both stores each day, we use the functions `groupby` and `count`. The former groups a particular column into diffent unique elements while the latter counts a particular element from the specific column. The counterpart of these script is using the `countif` function in excel.

In [143]:
both_store_count = pd.DataFrame(both_store.groupby('Date')['ID'].count())
both_store_count

            ID
Date
2019-01-21   6
2019-01-22   3
2019-01-23   5
2019-01-24   8
2019-01-25   2

To calculate the surface area, we know that

In [144]:
%%latex
\begin{equation*}
Surface Area = 2 * (lw + wh + lh)
\end{equation*}

and

In [145]:
%%latex
\begin{equation*}
Volume = lwh
\end{equation*}

With those definitions, we added columns concerning the Surface Areas and Volumes. Instead of using `for` loop, we can `vectorize` basic functions such as adding, subtracting etc.

In [146]:
store_a['Surface_Area'] = 2 * (store_a['Length'] * store_a['Width'] + store_a['Width'] * store_a['Height'] + store_a['Height'] * store_a['Length'])
store_b['Surface_Area'] = 2 * (store_b['Length'] * store_b['Width'] + store_b['Width'] * store_b['Height'] + store_b['Height'] * store_b['Length'])

In [147]:
store_a['Volume'] = store_a['Length'] * store_a['Width'] * store_a['Height']
store_b['Volume'] = store_b['Length'] * store_b['Width'] * store_b['Height']

In [148]:
store_b.head()

     ID       Date  Length  Width  Height  Surface_Area  Volume
0  8002 2019-01-24      13     10       4           444     520
1  2019 2019-01-21      10      7       6           344     420
2  8014 2019-01-21       1     12       7           206      84
3  1012 2019-01-24       3      7       7           182     147
4  4004 2019-01-22       1     12       9           258     108

By using the `type` function, we realized that it is a number (integer). In this case, we could use the `%` function to filter `id` ending with a `7`.

In [149]:
type(store_b['ID'][1])

numpy.int64

The usage of `where` functions operates similarly to `if` when creating a function. Unlike `if`, the `where` function can be applied to columns. Since there are 10 decimeters in 1 meter, we convert and make sure that the areas and volumes have same measurement units respectively.

In [150]:
store_a['payment'] = np.where(store_a['ID'] % 10==7, store_a['Surface_Area'] * 0.01 + store_a['Surface_Area']  * 0.50 * 0.001 , store_a['Surface_Area'] + store_a['Surface_Area']  * 0.50)
store_b['payment'] = np.where(store_b['ID'] % 10==7, store_b['Surface_Area'] * 0.01 + store_b['Surface_Area']  * 0.50 * 0.001 , store_b['Surface_Area'] + store_b['Surface_Area']  * 0.50)

In [151]:
store_a.head()

   ID       Date  Length  Width  Height  Surface_Area  Volume  payment
0  15 2019-01-24       6      2       5           104      60    156.0
1  28 2019-01-21      13      1       2            82      26    123.0
2  36 2019-01-21      15      3      13           558     585    837.0
3  42 2019-01-24      14     10       1           328     140    492.0
4  79 2019-01-22      10      7      11           514     770    771.0

Lastly, we can extract the sum of the payments via using the similar method for getting number of products from both store. The function does something same as `sumif` of excel.

In [152]:
store_a_revenue = pd.DataFrame(store_a.groupby('Date')['payment'].sum())
store_a_revenue

               payment
Date
2019-01-21  105309.675
2019-01-22  111131.514
2019-01-23  103590.642
2019-01-24  107501.232
2019-01-25   93477.201

In [153]:
store_b_revenue = pd.DataFrame(store_b.groupby('Date')['payment'].sum())
store_b_revenue

               payment
Date
2019-01-21  110923.428
2019-01-22  116638.113
2019-01-23  103334.772
2019-01-24  103119.078
2019-01-25   99651.951

In [154]:
store_dif = store_a_revenue - store_b_revenue
store_dif

             payment
Date
2019-01-21 -5613.753
2019-01-22 -5506.599
2019-01-23   255.870
2019-01-24  4382.154
2019-01-25 -6174.750

`Problem 2`: Given a hypothetical time series data, create a `moving average(5)` by standardizing the series first (the initial score must be 100) and get the dates for where the moving average is the highest. For example,
the series `20,15,20,25,13` must become `100,75,100,125,65`. since `75 = ((15-20)/20 * 100)) + 100` and `125 = ((25-20)/20 * 100)) + 100`

We read the dataframe first and we noticed that there are empty values. In this case, we have to fill them.

In [155]:
ts_data = pd.read_excel('Time_Series_Example_Data.xlsx')
ts_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
Date    1000 non-null datetime64[ns]
TS_A    930 non-null float64
TS_B    921 non-null float64
TS_C    936 non-null float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 31.3 KB

In [156]:
ts_data.head()

        Date  TS_A  TS_B  TS_C
0 2016-01-01  15.0  37.0  28.0
1 2016-01-02  18.0  37.0  21.0
2 2016-01-03  11.0  34.0  22.0
3 2016-01-04  18.0  35.0  23.0
4 2016-01-05  19.0  35.0  25.0

There are three ways to manipulate missing data. We could remove rows that have a `NaN`, however, it would decrease the number of datapoints we have, hence compromising the quality of analysis. On the other hand, we could replace it with a particular number but we are given a time series data and each value is affected by its first value so we will use `forward fill` and `backward fill`. The former propagates last valid observation forward to next valid while the  latter uses next valid observation to fill gap ([pandas.DataFrame.fillna](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html))

In [157]:
ts_data_ffill = ts_data.fillna(method='ffill')
ts_data_bfill = ts_data.fillna(method='bfill')

Then, we set the `Date` column as the index for the time series.

In [158]:
ts_data_ffill = ts_data_ffill.set_index("Date")
ts_data_bfill = ts_data_bfill.set_index("Date")

In [159]:
ts_data_ffill.head()

            TS_A  TS_B  TS_C
Date
2016-01-01  15.0  37.0  28.0
2016-01-02  18.0  37.0  21.0
2016-01-03  11.0  34.0  22.0
2016-01-04  18.0  35.0  23.0
2016-01-05  19.0  35.0  25.0

In [160]:
type(ts_data_ffill['TS_A'][1])

numpy.float64

Since the values are of the type `numpy.float64`, we can do basic operations on them. We created a function that is applicable to a column.

In [161]:
def normalize_ts(df):
    temp = []
    for i in range(len(df)):
        temp.append((((df.iloc[i]-df.iloc[0])/df.iloc[0])* 100)+100)
    return pd.DataFrame(temp,index=ts_data_ffill.index)

Also, we can apply functions to a column given that we have the correct type of variable.

In [162]:
ts_data_ffill['TS_A'] = normalize_ts(ts_data_ffill['TS_A'])
ts_data_ffill['TS_B'] = normalize_ts(ts_data_ffill['TS_B'])
ts_data_ffill['TS_C'] = normalize_ts(ts_data_ffill['TS_C'])

In [163]:
ts_data_bfill['TS_A'] = normalize_ts(ts_data_bfill['TS_A'])
ts_data_bfill['TS_B'] = normalize_ts(ts_data_bfill['TS_B'])
ts_data_bfill['TS_C'] = normalize_ts(ts_data_bfill['TS_C'])

From that, we overwrote the columns and we can go to the rolling mean. There is a difference between rolling mean and moving average. The former returns the average of the current value and the previous values while the moving average returns the current value, previous values, and next values.For more explanation see this [link](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html).

In [164]:
x = pd.DataFrame([1,2,4,6,8,4,3,2],columns=['sample'])
x['1']= x['sample'].rolling(5,center=True).mean()
x['2']= x['sample'].rolling(5,center=False).mean()
x

   sample    1    2
0       1  NaN  NaN
1       2  NaN  NaN
2       4  4.2  NaN
3       6  4.8  NaN
4       8  5.0  4.2
5       4  4.6  4.8
6       3  NaN  5.0
7       2  NaN  4.6

In [165]:
ts_data_ffill = ts_data_ffill.rolling(5,center=True).mean()
ts_data_ffill = ts_data_ffill.fillna(method='bfill')
ts_data_ffill = ts_data_ffill.fillna(method='ffill')

In [166]:
ts_data_bfill = ts_data_bfill.rolling(5,center=True).mean()
ts_data_bfill = ts_data_bfill.fillna(method='bfill')
ts_data_bfill = ts_data_bfill.fillna(method='ffill')

Lastly, we want to extract the dates in which the MA(5) is the highest, therefore we used `idxmax` to return the index having the maximum value.

In [167]:
ts_data_ffill['TS_A'].idxmax(),ts_data_ffill['TS_B'].idxmax(),ts_data_ffill['TS_C'].idxmax()

(Timestamp('2017-01-06 00:00:00'),
 Timestamp('2018-08-21 00:00:00'),
 Timestamp('2016-10-04 00:00:00'))

In [168]:
ts_data_bfill['TS_A'].idxmax(),ts_data_bfill['TS_B'].idxmax(),ts_data_bfill['TS_C'].idxmax()

(Timestamp('2017-01-06 00:00:00'),
 Timestamp('2018-08-21 00:00:00'),
 Timestamp('2016-10-04 00:00:00'))

For the next chapters, we will discuss on how to `pythonize` one's code. In this [link](https://docs.python-guide.org/writing/style/), there are following examples. Our interpretation is that, the code must be readable, correct, concise (the shorter the code, the better), and fast.

## <font color=darkgreen>VI. complexity</font>

`Complexity` is defined as the amount of resources required for running a code. In our case, we usually want to shorten our execution time. The following are examples of using different functions to get a specific value. The code for measuring the execution time is `%timeit`

`Problem`: Suppose we have a dataset of the people who rode the `Titanic`, we want to know how many women survived and how many of the are in the `Second class`

In [169]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

The following columns are named according to these conventions:
    1. `survived` - 1 if the person survived, 0 if not.
    2. `pclass` - code number for passenger class, 1 for first, 2 for second etc.
    3. `sex` - male or female
    4. `age` - age of the passenger
    5. `sibling` - number of siblings
    6. `parch` - Number of Parent/Child aboard
    7. `fare` - the passenger fare
    8. `embarked` - The port in which a passenger has embarked. C - Cherbourg, S - Southampton, Q = Queenstown
    9. `class` - passenger class
    10. `who`- man or woman
    11. `adult_male` - Yes if it is an adult male, not if it is not
    12. `deck` - `C` if crew, empty if not.
    13. `embark_town` - where are the passengers going
    14. `alive` - yes if the passenger is alive, not if not.
    15. `alone` - yes if the passenger is riding alone, not if not

Method 1 :We used groupby,aggregate and unstack.

In [170]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('sum').unstack()

class   First  Second  Third
sex
female     91      70     72
male       45      17     47

In [171]:
 %timeit titanic.groupby(['sex', 'class'])['survived'].aggregate('sum').unstack()

2.73 ms ± 18.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Method 2: We used multiple filters on the dataframe

In [172]:
len(titanic[(titanic['sex'] == 'female') & (titanic['survived'] == 1 ) & (titanic['class'] == 'Second')])

70

In [173]:
 %timeit len(titanic[(titanic['sex'] == 'female') & (titanic['survived'] == 1 ) & (titanic['class'] == 'Second')])

2.1 ms ± 32.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In terms of this problem, list comprehension is faster than using `groupby-aggregate-unstack`. However, if you do not know what are the unique values for each column, use the `unique` function.

`Problem:` Return the letters of the word `uncopyrightable`

In [174]:
%timeit list(map(lambda x: x, 'uncopyrightable'))

2.13 µs ± 12.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [175]:
%timeit [letter for letter in 'uncopyrightable']

837 ns ± 27 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

The function both returned the letters but the second function is executed at 476 nanoseconds, less than the first's 1350 nanoseconds, thus, the second one is faster. Although the difference is negligible, applying the functions to list containing 1e+9 elements would make a difference.

`Problem`: Given a set of numbers, return numbers divisible both by 7 and 5

In [176]:
%timeit [y for y in range(100) if y % 7 == 0 if y % 5 == 0]

7.72 µs ± 31.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [177]:
%timeit [y for y in range(100) if y % 35 == 0]

6.81 µs ± 50.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In this case, if a problem can be reduced to a simpler one, attempt to combine similar elements.

The function `eval` from pandas can support basic operational and chained values. Also, the `eval` functions yield same results as the typical functions. The equality of the results can be checked by using `allclose` function from numpy.

In [178]:
rng = np.random.RandomState(42)
df = pd.DataFrame(rng.rand(1000, 3), columns=['A', 'B', 'C'])
df.head()

          A         B         C
0  0.374540  0.950714  0.731994
1  0.598658  0.156019  0.155995
2  0.058084  0.866176  0.601115
3  0.708073  0.020584  0.969910
4  0.832443  0.212339  0.181825

In [179]:
result1 = (df['A'] + df['B']) / (df['C'] - 1)
result2 = pd.eval("(df.A + df.B) / (df.C - 1)")
np.allclose(result1, result2)

True

In [180]:
%timeit (df['A'] + df['B']) / (df['C'] - 1)

334 µs ± 9.64 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [181]:
%timeit pd.eval("(df.A + df.B) / (df.C - 1)")

1.7 ms ± 9.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

Although it is slower than the usual, `eval` does not create intermediate list in which it might cost some memory. For details regarding the function, please see this [link](https://nbviewer.jupyter.org/github/TarrySingh/Machine-Learning-Tutorials/blob/master/pandas/03.12-Performance-Eval-and-Query.ipynb).

References: `(1)` [List Comprehension](https://www.programiz.com/python-programming/list-comprehension)